{"pages":[],"posts":[{"title":"计算机网络开篇","text":"互联网：网络把主机连接起来，而互联网是通过某种协议将多种不同的网络连接起来，因此互联网是网络的网络。国际标准的互联网写法是internet，字母i小写！ 互联网、因特网与万维网 端系统通信方式：C/S与P2P 比特率与带宽 IP、端口号和DNS 计算机网络体系结构 互联网、因特网与万维网 互联网：网络把主机连接起来，而互联网是通过某种协议将多种不同的网络连接起来， 因此互联网是网络的网络。 国际标准的互联网写法是internet，字母i小写！ 因特网：采用TCP/IP协议族作为通信的规则的互联网。国际标准的因特网写法是Internet，字母I大写！ TCP/IP协议由很多协议组成，不同类型的协议又被放在不同的层，其中，位于应用层的协议就有很多，比如FTP、SMTP、HTTP。所以，因特网提供的服务一般包括有：www（万维网）服务、电子邮件服务（outlook）、远程登录（QQ）服务、文件传输（FTP）服务、网络电话等等 万维网(www)：只要应用层使用的是HTTP协议，就称为万维网。万维网又称环球网，是一种建立在Internet上的全球性的、交互的、动态、多平台、分布式、图形信息系统。它只是建立在Internet上的一种网络服务。 之所以在浏览器里输入百度网址时，能看见百度网提供的网页，就是因为你的个人浏览器和百度网的服务器之间使用的是HTTP协议在交流。 三者关系：互联网包含因特网，因特网包含万维网 目前，围绕互联网发展的业务主要有两类，分别是ISP（因特网服务提供商）与ICP（因特网网内容提供商） ISP(Internet Service Provider):指向广大用户综合提供互联网接入业务、信息业务和增值业务的电信运营商（比如中国电信、移动、联通提供的宽度服务）ISP拥有从因特网管理机构申请到的多个IP地址，同时拥有通信线路以及路由器等连网设备。中国的电信、网通等都是ISP，我们通常所说的上网就是指通过某个ISP接入到因特网，IP地址的管理机构不会把一个单个的IP地址分配给单个用户，而是把一批IP地址有偿地分配给经审查合格的ISP。现在的因特网是由全世界无数个大大小小的ISP所共同拥有的。 ICP(Internet Content Provider):向广大用户综合提供互联网信息和增值业务的企业（比如：新浪、搜狐、腾讯）。其实，我们说的ICP域名备案就是指互联网内容提供商向工信部提交经营审核。 互联网的组成因特网的拓扑结构虽然非常复杂，并且在地理上覆盖全球，单从工作方式上看，可以划分为以下两大块： 网络边缘：由所连接在因特网上的主机组成。这部分是用户直接使用的，用来进行通信和资源共享。主机也称为端系统 网络核心：由大量网络和连接这些网络的路由器组成。这部分是为边缘部分提供服务的 在互联网边缘的端系统之间的通信方式通常可划分为两类： 客户服务器方式（Client/Server, C/S方式）：客户和服务器都是指通信中所涉及到的两个应用进程。最主要的特征是：客户是服务请求方，服务器是服务提供方C/S方式是因特网上最常用的传统方式，我们在网上发送电子邮件或在网站上查找资料时，都是客户服务器方式。 对等方式（Peer-to-Peer, P2P方式）：两个主机在通信时并不区分哪一个是服务请求者还是服务提供者，这要两个主机都运行了对等连接软件，他们就可以进行平等的、对等连接通信。这时，双方都可以下载对方已经存储在硬盘中的共享文档，因此这种工作方式也称为P2P文件共享。 还有一种被称为浏览器服务器的方式（B/S, Browser/Server方式），可以看作是客户服务器方式的特例。只不过客户端是浏览器而已。 互联网核心部分 电路交换 ：电路交换用于电话通信系统，两个用户要通信之前需要建立一条专用的物理链路，并且在整个通信过程中始终占用该链路。由于通信的过程中不可能一直在使用传输线路，因此电路交换对线路的利用率很低，往往不到 10%。 分组交换 ：分组交换采用存储转发技术。每个分组都有首部和尾部，包含了源地址和目的地址等控制信息，在同一个传输线路上同时传输多个分组互相不会影响，因此在同一条传输线路上允许同时传输多个分组，也就是说分组交换不需要占用传输线路。 计算机网络类别按照网络的作用范围进行分类 广域网WAN: 通过长距离(例如跨越不同国家)运送主机发送数据。 作用范围通常为几十到几千公里 城域网MAN: 一般是一个城市。 作用距离为5~50km 局域网LAN: 用计算机或工作站通过高速通信线路相连。作用距离为1km左右。学校或企业大都拥有多个互连的局域网称为校园网或企业网。 个人局域网PAN:把属于个人的电子设备用无线技术连接起来的网络，也常称为无线个人局域网(WPAN)。 作用距离10m左右。 按照网络的使用者进行分类 公用网： 指电信公司出资建造的大型网络。需要向电信公司交纳一定的费用 专用网： 指某个部门因为特殊业务工作需要而建造的网络。不向本单位以外的人提供服务。如军队、铁路、银行、电力系统等。 用来把用户接入到互联网的网络接入网AN： 搭建起用户与互联网连接的”桥梁”。 计算机网络的性能 比特率：连接在计算机网络上的主机在数字信道上传送数据的速率。比特率速率的单位是b/s（比特每秒），有时候也写为bps，即bit persecond 带宽：表示在单位时间内从网络的某一点到另一点所能通过的最高数据率,单位是bit/s。 吞吐量：在单位时间内通过某个网络的实际数据量。是表示实际网络传输是的速率。 受网络带宽或网络的额定速率的限制。 时延：数据从网络一端传送到另一端所需要的时间。(1) 发送时延： 主机或路由器发送数据帧所需要的时间(2) 排队时延： 分组经过路由器后，要先在输入队列中排队等待处理(3) 处理时延： 主机或路由器收到分组时需要花费一定时间进行处理，如分析首部、提取数据部分、差错检测等。(4) 传播时延： 电磁波在信道中传播一定距离花费的时间。约为光速。 总时延 = 发送时延 + 排队时延 + 处理时 + 延传播时延 另外，在描述数据量大小时，往往使用字节（byte）作为度量单位。一个字节（记为大写的B）代表8个bit即1byte = 8bit在实际上网应用中，下载软件时常常看到诸如下载速度显示为176KB/s，103KB/s等宽带速率大小字样，因为ISP提供的线路带宽使用的单位是比特（bit），而一般下载软件显示的是字节（Byte）（1Byte=8bit），所以要通过换算，才能得实际值。我们以1M宽带为例，按照换算公式换算一下：1Mb/s=1024*1024b/s=1024K b/s=1024/8KB/s=128KB/s 计算机网络体系结构 OSI模型是国际标准组织提出过一个标准框架，只要遵循OSI标准，一个系统就可以和世界上任何地方的、也遵循统一标准的其他任何系统进行通信。但它既复杂又不实用。TCP/IP是一个四层的体系结构，包含应用层、传输层、网际层和网际接口层。不过从实质上讲，TCP/IP只有最上面的三层，网际接口层并没有什么具体内容。因此学习计算机网络的原理时往往采取折中的办法，即总和OSI和TCP/IP的优点，采用一种五层协议的体系结构。 下面看一下每层的具体作用： 应用层 ：为特定应用程序提供数据传输服务，例如 HTTP、DNS 等协议。数据单位为报文。 传输层 ：为进程提供通用数据传输服务。由于应用层协议很多，定义通用的传输层协议就可以支持不断增多的应用层协议。传输层包括两种协议： 传输控制协议 TCP，提供面向连接、可靠的数据传输服务，数据单位为报文段；用户数据报协议 UDP，提供无连接、尽最大努力的数据传输服务，数据单位为用户数据报。 TCP 主要提供完整性服务，UDP 主要提供及时性服务。 网络层 ：为主机提供数据传输服务。而传输层协议是为主机中的进程提供数据传输服务。网络层把传输层传递下来的报文段或者用户数据报封装成分组。 数据链路层 ：网络层针对的还是主机之间的数据传输服务，而主机之间可以有很多链路，链路层协议就是为同一链路的主机提供数据传输服务。数据链路层把网络层传下来的分组封装成帧。 物理层 ：考虑的是怎样在传输媒体上传输数据比特流，而不是指具体的传输媒体。物理层的作用是尽可能屏蔽传输媒体和通信手段的差异，使数据链路层感觉不到这些差异。 OSI中的剩余两层： 表示层 ：数据压缩、加密以及数据描述，这使得应用程序不必关心在各台主机中数据内部格式不同的问题。 会话层 ：建立及管理会话。五层协议没有表示层和会话层，而是将这些功能留给应用程序开发者处理。 数据传输过程： 在向下的过程中，需要添加下层协议所需要的首部或者尾部，而在向上的过程中不断拆开首部和尾部。","link":"/2020/03/06/%E8%AE%A1%E7%AE%97%E6%9C%BA%E7%BD%91%E7%BB%9C%E5%BC%80%E7%AF%87/"}],"tags":[{"name":"计算机网络","slug":"计算机网络","link":"/tags/%E8%AE%A1%E7%AE%97%E6%9C%BA%E7%BD%91%E7%BB%9C/"}],"categories":[{"name":"计算机基础","slug":"计算机基础","link":"/categories/%E8%AE%A1%E7%AE%97%E6%9C%BA%E5%9F%BA%E7%A1%80/"},{"name":"计算机网络","slug":"计算机基础/计算机网络","link":"/categories/%E8%AE%A1%E7%AE%97%E6%9C%BA%E5%9F%BA%E7%A1%80/%E8%AE%A1%E7%AE%97%E6%9C%BA%E7%BD%91%E7%BB%9C/"}]}